## 1.

In [1]:
import pandas as pd

In [2]:
data_series = pd.Series(data = [4,8,15,16,23,42] )

In [3]:
data_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## 2.

In [4]:
list_series = ["ayush" , 19 , 'raj' , 19.5 , "rrr" ,["cricket" ], True , 1 , 432.45 , "fgfd"]

In [5]:
data_series2 = pd.Series(list_series)

In [6]:
data_series2

0        ayush
1           19
2          raj
3         19.5
4          rrr
5    [cricket]
6         True
7            1
8       432.45
9         fgfd
dtype: object

## 3.

In [7]:
df = pd.DataFrame({'Name': ['Alice' , 'Bob' , 'Claire' ] ,
                  'Age' :[25 , 30 , 27 ] ,
                  'Gender': ['Female' , 'Male' , 'Female'] } )

In [8]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## 4.

    Dataframe is  a two dimenstional tabular data structure in pandas library .
    It is just like a table in SQL.

    Data Series is one dimensional array containing single row or column record.
    It is the subset of Data Frame.

In [16]:
data_series_1 = pd.Series(["one" , "two" , "three" , "four"])
print(data_series_1)
type(data_series_1)

0      one
1      two
2    three
3     four
dtype: object

pandas.core.series.Series

In [20]:
data_series_2 = pd.Series(["five" , "six" , "seven" , "eight"])
print(data_series_2)
type(data_series_2)

0     five
1      six
2    seven
3    eight
dtype: object

pandas.core.series.Series

In [23]:
df1 = pd.DataFrame([data_series_1 , data_series_2])
print(df1)
type(df1)

      0    1      2      3
0   one  two  three   four
1  five  six  seven  eight

pandas.core.frame.DataFrame

## 5.

    Some column functions for manipulating dataframes are:

In [66]:
df2 = pd.DataFrame([range(10) , range(10,20) , range(20,30) ,
                                 range(30,35) , range(40,50) , range(50,60) , range(60,65)] )

In [67]:
df2

    0   1   2   3   4     5     6     7     8     9
0   0   1   2   3   4   5.0   6.0   7.0   8.0   9.0
1  10  11  12  13  14  15.0  16.0  17.0  18.0  19.0
2  20  21  22  23  24  25.0  26.0  27.0  28.0  29.0
3  30  31  32  33  34   NaN   NaN   NaN   NaN   NaN
4  40  41  42  43  44  45.0  46.0  47.0  48.0  49.0
5  50  51  52  53  54  55.0  56.0  57.0  58.0  59.0
6  60  61  62  63  64   NaN   NaN   NaN   NaN   NaN

In [72]:
# 1. drop()
df2_drop = df2.drop([7,8] , axis = 1) 
df2_drop

    0   1   2   3   4     5     6     9
0   0   1   2   3   4   5.0   6.0   9.0
1  10  11  12  13  14  15.0  16.0  19.0
2  20  21  22  23  24  25.0  26.0  29.0
3  30  31  32  33  34   NaN   NaN   NaN
4  40  41  42  43  44  45.0  46.0  49.0
5  50  51  52  53  54  55.0  56.0  59.0
6  60  61  62  63  64   NaN   NaN   NaN

In [91]:
# 2. assign(col_naem = data)
df2_assign = df2.assign(added = range(7))
df2_assign

    0   1   2   3   4     5     6     7     8     9  added
0   0   1   2   3   4   5.0   6.0   7.0   8.0   9.0      0
1  10  11  12  13  14  15.0  16.0  17.0  18.0  19.0      1
2  20  21  22  23  24  25.0  26.0  27.0  28.0  29.0      2
3  30  31  32  33  34   NaN   NaN   NaN   NaN   NaN      3
4  40  41  42  43  44  45.0  46.0  47.0  48.0  49.0      4
5  50  51  52  53  54  55.0  56.0  57.0  58.0  59.0      5
6  60  61  62  63  64   NaN   NaN   NaN   NaN   NaN      6

In [110]:
# 3. merge() : - 
data_to_be_merged = pd.DataFrame({1 : range(8,15) })
print(data_to_be_merged)
df2_merge = df2_assign.merge( data_to_be_merged , how = "outer" , on = 1 )
df2_merge

    1
0   8
1   9
2  10
3  11
4  12
5  13
6  14

       0   1     2     3     4     5     6     7     8     9  added
0    0.0   1   2.0   3.0   4.0   5.0   6.0   7.0   8.0   9.0    0.0
1   10.0  11  12.0  13.0  14.0  15.0  16.0  17.0  18.0  19.0    1.0
2   20.0  21  22.0  23.0  24.0  25.0  26.0  27.0  28.0  29.0    2.0
3   30.0  31  32.0  33.0  34.0   NaN   NaN   NaN   NaN   NaN    3.0
4   40.0  41  42.0  43.0  44.0  45.0  46.0  47.0  48.0  49.0    4.0
5   50.0  51  52.0  53.0  54.0  55.0  56.0  57.0  58.0  59.0    5.0
6   60.0  61  62.0  63.0  64.0   NaN   NaN   NaN   NaN   NaN    6.0
7    NaN   8   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN    NaN
8    NaN   9   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN    NaN
9    NaN  10   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN    NaN
10   NaN  12   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN    NaN
11   NaN  13   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN    NaN
12   NaN  14   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN    NaN

## 6.

    If we are talking about mutability , then there are two themes of mutability :
        *Size Mutability
        *Value Mutability

    So , Every data structures whether data series , data frame or data panel , all these are value mutable.

    But , when we talk about size mutability , it is not always size mutalble.
    like the length of the series can't be changed but columns can be inserted at the end.

## 7.

In [148]:
ser_1 = pd.Series(  data = ["one" ,"two" , "three" ])
print(ser_1)

0      one
1      two
2    three
dtype: object

In [149]:
ser_2 = pd.Series(  data = ["four" ,"five" , "six" ])
print(ser_2)

0    four
1    five
2     six
dtype: object

In [156]:
df_from_ser = pd.DataFrame(data = [ser_1,ser_2]  )
df_from_ser

      0     1      2
0   one   two  three
1  four  five    six